/* Объявления простых переменных:
let/const (объявление типа переменной) name (имя переменной) = 'test' (значение переменной) ; (окончание выражения)
let (присвоение значения переменной, можно переприсвоить) 
const (переменная величина которой, не меняет своё значение)
var (устаревшее, не надо использовать, вместо этого let) 
ЭТО ОКАЗАЛИСЬ ОПЕРАТОРЫ ПРИСВАИВАНИЯ*/
let a = 1;
console.log (a);
a = 'test';
console.log (a);
a = 'dota';
console.log (a);

const b = 2;
console.log (b);
// при попытке переприсвоить значение консоль выдает ошибку
b = 'test';
console.log (b);

/* арифмитические и строковые операторы */
